ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ssu_gen_regs.xml
<module id="SSU_GEN_REGS" HW_revision="" description="SSU GEN Registers">
	<register id="REVISION" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Module Revision Register">
		<bitfield id="MINREV" description="Minor Revision Number" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="MAJREV" description="Major Revision Number" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="UPP_REVISION" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="User Protection Policy Revision">
		<bitfield id="REV" description="User Protection Policy Revision" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SSUMODE" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Safety and Security Operational Mode">
		<bitfield id="OPMODE" description="SSU Operational Mode" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="LINK2_AP_OVERRIDE" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="LINK2 Access Protection Override Register">
		<bitfield id="CPU1" description="CPU1 LINK2 Access Protection Override Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU2" description="CPU2 LINK2 Access Protection Override Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU3" description="CPU3 LINK2 Access Protection Override Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="BOOTMODE_STAT" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="User Boot Mode Status Register">
		<bitfield id="PIN_STAT" description="Boot Mode Pin Status" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOTPIN_CONFIG" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="User Emulation Boot Pin Configuration">
		<bitfield id="BMSP0" description="Boot Mode Select Pin 0" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="BMSP1" description="Boot Mode Select Pin 1" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="BMSP2" description="Boot Mode Select Pin 2" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="KEY" description="Register Valid Key" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOT_DIAG" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="User Emulation Boot Options">
		<bitfield id="LPOST_EN" description="LPOST Enable" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LPOST_COVER" description="LPOST Coverage" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MPOST_EN" description="MPOST Enable" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOT_CLKCFG" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="User Emulation Boot Clock Configuration Register">
		<bitfield id="IMULT" description="Secure Boot PLL IMULT" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="ODIV" description="Secure Boot PLL ODIV" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="REFDIV" description="Secure Boot PLL REFDIV" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="PLLEN" description="Secure Boot PLL Enable" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="EMU_BOOTEN" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="User Emulation Boot Enable">
		<bitfield id="ENABLE" description="Emulation Boot Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="RAMOPEN_LOCK" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="RAMOPEN Feature Lock Register">
		<bitfield id="LOCK" description="RAMOPEN Lock" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="RAMOPEN_COMMIT" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="RAMOPEN Feature Commit Register">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUID" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="CPUID Register">
		<bitfield id="CPUID" description="CPUID Value" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="DBGREAD" description="Debug Read Status" begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="BANKMAP" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="Valid Banks">
		<bitfield id="CPU1SWAP" description="CPU1 Bank Swap" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CPU3SWAP" description="CPU3 Bank Swap" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="BANKMAP_LOCK" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Bank Map Lock Register">
		<bitfield id="LOCK1" description="CPU1 Bank Swap Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK2" description="CPU3 Bank Swap Lock" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="BANKMAP_COMMIT" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Bank Map Commit Register">
		<bitfield id="COMMIT1" description="CPU1 Bank Swap Commit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT2" description="CPU3 Bank Swap Commit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="BANKMODE" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="Bank Mode Configuration Register">
		<bitfield id="MODE" description="Device Flash Configuration Mode" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="BANKMODE_LOCK" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="Bank Mode Lock Register">
		<bitfield id="LOCK" description="Bank Mode Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="BANKMODE_COMMIT" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Bank Mode Commit Register">
		<bitfield id="COMMIT" description="Bank Mode Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
