ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ssu_gen_regs.xml
	<register id="SECCFG_UPDATE_CFG" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="SECCFG Flash Update Configuration Register">
		<bitfield id="LINK_OWNER" description="SECCFG Update Owner LINK" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CPU_OWNER" description="SECCFG Update Owner CPU" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="UPDATE_EN" description="SECCFG Update Enable" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="PROG_BANKMODE" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="Programming BANKMODE Register">
		<bitfield id="MODE" description="Device Flash Configuration Mode" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="SECVALID" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Valid SECCFG Sector">
		<bitfield id="CPU1" description="Valid CPU1/CPU2 SECCFG Sector" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CPU3" description="Valid CPU3 SECCFG Sector" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="SECVALID_LOCK" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Valid SECCFG Sector Lock Register">
		<bitfield id="LOCK" description="SECVALID LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SECVALID_COMMIT" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="Valid SECCFG Sector Commit Register">
		<bitfield id="COMMIT" description="Security Sectors Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ZONE1_CFG" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="ZONE1 Configuration">
		<bitfield id="FWU_LINK" description="Firmware Update Owner LINK" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="FWU_CPU" description="Firmware Update Owner CPU" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="UPDATE_EN" description="ZONE1 Update Enable" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="ZONE2_CFG" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="ZONE2 Configuration">
		<bitfield id="FWU_LINK" description="Firmware Update Owner LINK" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="FWU_CPU" description="Firmware Update Owner CPU" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="UPDATE_EN" description="ZONE2 Update Enable" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="ZONE3_CFG" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="ZONE3 Configuration">
		<bitfield id="FWU_LINK" description="Firmware Update Owner LINK" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="FWU_CPU" description="Firmware Update Owner CPU" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="UPDATE_EN" description="ZONE3 Update Enable" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DEBUG_CFG" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Debug Configuration">
		<bitfield id="C29DBGEN_CFG" description="C29DBGEN Enable Configuration" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="ZONE1" description="ZONE1 Debug Enable Configuration" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="ZONE2" description="ZONE2 Debug Enable Configuration" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="ZONE3" description="ZONE3 Debug Enable Configuration" begin="14" end="12" width="3" rwaccess="RW"/>
	</register>
	<register id="DEBUG_CFG_LOCK" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Debug Configuration Lock Register">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DEBUG_CFG_COMMIT" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Debug Configuration Commit Register">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DEBUG_STAT" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="Debug Status Register">
		<bitfield id="ZONE1" description="ZONE1 Debug State" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="ZONE2" description="ZONE2 Debug State" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="ZONE3" description="ZONE3 Debug State" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="C29DBGS" description="C29 Debug Status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="C29DBGEN" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="C29 Debug Enable Register">
		<bitfield id="ENA" description="C29 Debug Enable" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="ZONE_DBGEN" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="ZONE Debug Enable Register">
		<bitfield id="ZONE1" description="ZONE1 Debug Enable" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="ZONE2" description="ZONE2 Debug Enable" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="ZONE3" description="ZONE3 Debug Enable" begin="21" end="16" width="6" rwaccess="RW"/>
	</register>
	<register id="BEPROT_BANK" width="32" page="0" offset="0x200" instances="1" instaddr="4" internal="0" description="Bank Erase Protection Bank Register">
		<bitfield id="BANKID" description="Bank Erase Bank" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="FLCID" description="Bank Erase Bank" begin="4" end="3" width="2" rwaccess="RW"/>
	</register>
	<register id="BEPROT_STAT" width="32" page="0" offset="0x204" instances="1" instaddr="4" internal="0" description="Bank Erase Status Register">
		<bitfield id="READY" description="Bank Erase State Machine Ready" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE" description="Bank Erase State Machine Initializing" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="BEPROTA" width="32" page="0" offset="0x208" instances="1" instaddr="4" internal="0" description="Bank Erase Protection Register A">
		<bitfield id="SECT0" description="Sector 0 Bank Erase Protection" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SECT1" description="Sector 1 Bank Erase Protection" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SECT2" description="Sector 2 Bank Erase Protection" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SECT3" description="Sector 3 Bank Erase Protection" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SECT4" description="Sector 4 Bank Erase Protection" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SECT5" description="Sector 5 Bank Erase Protection" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SECT6" description="Sector 6 Bank Erase Protection" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SECT7" description="Sector 7 Bank Erase Protection" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SECT8" description="Sector 8 Bank Erase Protection" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SECT9" description="Sector 9 Bank Erase Protection" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SECT10" description="Sector 10 Bank Erase Protection" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SECT11" description="Sector 11 Bank Erase Protection" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SECT12" description="Sector 12 Bank Erase Protection" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SECT13" description="Sector 13 Bank Erase Protection" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SECT14" description="Sector 14 Bank Erase Protection" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SECT15" description="Sector 15 Bank Erase Protection" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SECT16" description="Sector 16 Bank Erase Protection" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SECT17" description="Sector 17 Bank Erase Protection" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SECT18" description="Sector 18 Bank Erase Protection" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SECT19" description="Sector 19 Bank Erase Protection" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SECT20" description="Sector 20 Bank Erase Protection" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SECT21" description="Sector 21 Bank Erase Protection" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SECT22" description="Sector 22 Bank Erase Protection" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SECT23" description="Sector 23 Bank Erase Protection" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="SECT24" description="Sector 24 Bank Erase Protection" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="SECT25" description="Sector 25 Bank Erase Protection" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="SECT26" description="Sector 26 Bank Erase Protection" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="SECT27" description="Sector 27 Bank Erase Protection" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="SECT28" description="Sector 28 Bank Erase Protection" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="SECT29" description="Sector 29 Bank Erase Protection" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="SECT30" description="Sector 30 Bank Erase Protection" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SECT31" description="Sector 31 Bank Erase Protection" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
