ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ssu_gen_regs.xml
	<register id="WEPROT_FLC1_B2_B" width="32" page="0" offset="0x344" instances="1" instaddr="4" internal="0" description="Flash Controller 1 B2 Write Erase Protection B">
		<bitfield id="SECT39_22" description="Sectors 39 - 22 Write Erase Protection" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_40" description="Sectors 47 - 40 Write Erase Protection" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT55_48" description="Sectors 55 - 48 Write Erase Protection" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_56" description="Sectors 63 - 56 Write Erase Protection" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT71_64" description="Sectors 71 - 64 Write Erase Protection" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_72" description="Sectors 79 - 72 Write Erase Protection" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT87_80" description="Sectors 87 - 80 Write Erase Protection" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_88" description="Sectors 95 - 88 Write Erase Protection" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT103_96" description="Sectors 103 - 96 Write Erase Protection" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_104" description="Sectors 111 - 104 Write Erase Protection" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT119_112" description="Sectors 119 - 112 Write Erase Protection" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_120" description="Sectors 127 - 120 Write Erase Protection" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SECT135_128" description="Sectors 135 - 128 Write Erase Protection" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_136" description="Sectors 143 - 136 Write Erase Protection" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SECT151_144" description="Sectors 151 - 144 Write Erase Protection" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_152" description="Sectors 159 - 152 Write Erase Protection" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SECT167_160" description="Sectors 167 - 160 Write Erase Protection" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_168" description="Sectors 175 - 168 Write Erase Protection" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SECT183_176" description="Sectors 183 - 176 Write Erase Protection" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_184" description="Sectors 191 - 184 Write Erase Protection" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SECT199_192" description="Sectors 199 - 192 Write Erase Protection" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_200" description="Sectors 207 - 200 Write Erase Protection" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SECT215_208" description="Sectors 215 - 208 Write Erase Protection" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_216" description="Sectors 223 - 216 Write Erase Protection" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SECT231_224" description="Sectors 231 - 224 Write Erase Protection" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_232" description="Sectors 239 - 232 Write Erase Protection" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SECT247_240" description="Sectors 247 - 240 Write Erase Protection" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_248" description="Sectors 255 - 248 Write Erase Protection" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="WEPROT_FLC1_B2_LOCK" width="32" page="0" offset="0x350" instances="1" instaddr="4" internal="0" description="Flash Controller 1 B2 WEPROTA Lock">
		<bitfield id="LOCK" description="System Access Protection Register Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="WEPROT_FLC1_B2_COMMIT" width="32" page="0" offset="0x354" instances="1" instaddr="4" internal="0" description="Flash Controller 1 B2 WEPROTA Commit">
		<bitfield id="COMMIT" description="System Access Protection Register Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="WEPROT_FLC2_B0_A" width="32" page="0" offset="0x3a0" instances="1" instaddr="4" internal="0" description="Flash Controller 2 B0 Write Erase Protection A">
		<bitfield id="SECT0" description="Sector 0 Write Erase Protection" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT1" description="Sector 1 Write Erase Protection" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT2" description="Sector 2 Write Erase Protection" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT3" description="Sector 3 Write Erase Protection" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT4" description="Sector 4 Write Erase Protection" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT5" description="Sector 5 Write Erase Protection" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT6" description="Sector 6 Write Erase Protection" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT7" description="Sector 7 Write Erase Protection" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT8" description="Sector 8 Write Erase Protection" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT9" description="Sector 9 Write Erase Protection" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT10" description="Sector 10 Write Erase Protection" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT11" description="Sector 11 Write Erase Protection" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT12" description="Sector 12 Write Erase Protection" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT13" description="Sector 13 Write Erase Protection" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT14" description="Sector 14 Write Erase Protection" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT15" description="Sector 15 Write Erase Protection" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SECT16" description="Sector 16 Write Erase Protection" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SECT17" description="Sector 17 Write Erase Protection" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SECT18" description="Sector 18 Write Erase Protection" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SECT19" description="Sector 19 Write Erase Protection" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SECT20" description="Sector 20 Write Erase Protection" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SECT21" description="Sector 21 Write Erase Protection" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SECT22" description="Sector 22 Write Erase Protection" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SECT23" description="Sector 23 Write Erase Protection" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SECT24" description="Sector 24 Write Erase Protection" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SECT25" description="Sector 25 Write Erase Protection" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SECT26" description="Sector 26 Write Erase Protection" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SECT27" description="Sector 27 Write Erase Protection" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SECT28" description="Sector 28 Write Erase Protection" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SECT29" description="Sector 29 Write Erase Protection" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SECT30" description="Sector 30 Write Erase Protection" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SECT31" description="Sector 31 Write Erase Protection" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="WEPROT_FLC2_B0_B" width="32" page="0" offset="0x3a4" instances="1" instaddr="4" internal="0" description="Flash Controller 2 B0 Write Erase Protection B">
		<bitfield id="SECT39_22" description="Sectors 39 - 22 Write Erase Protection" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_40" description="Sectors 47 - 40 Write Erase Protection" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT55_48" description="Sectors 55 - 48 Write Erase Protection" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_56" description="Sectors 63 - 56 Write Erase Protection" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT71_64" description="Sectors 71 - 64 Write Erase Protection" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_72" description="Sectors 79 - 72 Write Erase Protection" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT87_80" description="Sectors 87 - 80 Write Erase Protection" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_88" description="Sectors 95 - 88 Write Erase Protection" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT103_96" description="Sectors 103 - 96 Write Erase Protection" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_104" description="Sectors 111 - 104 Write Erase Protection" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT119_112" description="Sectors 119 - 112 Write Erase Protection" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_120" description="Sectors 127 - 120 Write Erase Protection" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SECT135_128" description="Sectors 135 - 128 Write Erase Protection" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_136" description="Sectors 143 - 136 Write Erase Protection" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SECT151_144" description="Sectors 151 - 144 Write Erase Protection" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_152" description="Sectors 159 - 152 Write Erase Protection" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SECT167_160" description="Sectors 167 - 160 Write Erase Protection" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_168" description="Sectors 175 - 168 Write Erase Protection" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SECT183_176" description="Sectors 183 - 176 Write Erase Protection" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_184" description="Sectors 191 - 184 Write Erase Protection" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SECT199_192" description="Sectors 199 - 192 Write Erase Protection" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_200" description="Sectors 207 - 200 Write Erase Protection" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SECT215_208" description="Sectors 215 - 208 Write Erase Protection" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_216" description="Sectors 223 - 216 Write Erase Protection" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SECT231_224" description="Sectors 231 - 224 Write Erase Protection" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_232" description="Sectors 239 - 232 Write Erase Protection" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SECT247_240" description="Sectors 247 - 240 Write Erase Protection" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_248" description="Sectors 255 - 248 Write Erase Protection" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
